{
  "text_welcome_title": "Dobrodošli u Ompluscript",
  "text_welcome_message": "Dobrodošli u  okvir, Ompluscript. Ompluscript je novi JavaScript & CSS okvir, razvijen radi dinamičkog renderovanja veb stranica. Okvir je reprezentovan u obliku MVC arhitekturalnog šablona, dizajniran u TypeScript i Less tehnologijama. Pruža mogućnost brzog dizajniranja veb stranica (uključujući i paradigmu prilagodljivog veb dizajna) i davanja logike za veb aplikaciju, kao pto su forme, prevod, upravljanje sesijom, i mnogo drugih mogućnosti. Još bolje, kod je proširiv, tako da mnogo drugih, novih funkcionalnosti se može lako dodati.",
  "text_home_title": "Početna",
  "text_serbian_title": "Srpski",
  "text_english_title": "Engleski",
  "text_layouts_title": "Rasporedi pogleda",
  "text_layouts_message": "Ova sekcija sadrži opis jezgra dizajna okvira Ompluscript - rasporede pogleda. Sa ovim rasporedima, možete napraviti različite dizajne veb stranica, upotrebom rasporeda koji najbolje odgovara svrsi veb stranice. U okviru Ompluscript, postoji (trenutno) 4 različita rasporeda pogleda:",
  "text_null_layout_title": "Prazan raspored",
  "text_null_layout_message": "Prazan raspored reprezentuje najjednostavniji raspred, na način da postavlja komponente jedne ispod drugih.",
  "text_null_layout_message_2": "Prazan raspored je standardni raspored za svaki pogled, pa zato nije potrebna specijalna konfiguracija za njega.",
  "text_relative_layout_title": "Relativni raspored",
  "text_relative_layout_message": "Iako Relativni raspored nije dobar izbor kada želite da koristite prilagodljivi veb dizajn, i dalje postoje određeni slučajevi kada želite da odredite striktnu poziciju za neku komponentu, kao u ovom slučaju: <pre>{\n  ...\n  styles:\n  {\n    top: \"50px\",\n    left: \"100px\",\n    width: \"200px\"\n  }\n}</pre>",
  "text_relative_layout_configuration": "Da bi postavili Relativni raspored, jednostavno postavite sledeću konfiguraciju u okviru jednog kontenjera pogleda:<pre>{\n  ...\n  layout:\n  {\n    type: \"RelativeLayout\",\n  }\n}</pre>",
  "text_table_layout_title": "Tabelarni raspored",
  "text_form_title": "Forme",
  "text_first_name_title": "Ime",
  "text_last_name_title": "Prezime",
  "text_user_name_title": "User name",
  "text_email_title": "Elektronska pošta",
  "text_password_title": "Šifra",
  "text_birthday_title": "Datum rođenja",
  "text_card_number_title": "Broj kartice",
  "text_register_title": "Registruj se",
  "text_404_error_title": "Stranica nije pronađena"
}