{
  "text_welcome_title": "Dobrodošli u Ompluscript",
  "text_welcome_message": "Dobrodošli u  okvir, Ompluscript. Ompluscript je novi JavaScript & CSS okvir, razvijen radi dinamičkog renderovanja veb stranica. Okvir je reprezentovan u obliku MVC arhitekturalnog šablona, dizajniran u TypeScript i Less tehnologijama. Pruža mogućnost brzog dizajniranja veb stranica (uključujući i paradigmu prilagodljivog veb dizajna) i davanja logike za veb aplikaciju, kao što su forme, prevod i mnogo drugih mogućnosti. Još bolje, kod je proširiv, tako da mnogo drugih, novih funkcionalnosti se može lako dodati.",
  "text_home_title": "Početna",
  "text_serbian_title": "Srpski",
  "text_english_title": "Engleski",
  "text_getting_started_title": "Da počnemo",
  "text_getting_started_message": "Ova sekcija sadrži jednostavne primere koji opisuju kako se koristi okvir Ompluscript. Kao što je navedeno, okvir Ompluscript je predstavljen kao MVC (Model-View-Controller ili Model-Pogled-Kontroler) arhitekturalni šablon, stoga će ova sekcija sadržati osnovne informacije o sva tri segmenta (Model, View and Controller) i takođe kako da se postavi finalna aplikacija. Sledeća lista sadrži linkove ka svakoj posebnoj sekciji:",
  "text_model_title": "Model",
  "text_model_message": "Model je prva komponenta u okviru Ompluscript. Koristi se kao skladište podataka, tako da se može koristi za komunikaciju sa veb serverom (Ajax), ili sa veb čitačima (SessionStorage i LocalStorage). Jedan model može posedovati različite tipove atributa i svaki atribut može biti korišćen za različite tipove validacije, kao što je predstavljeno u sledežem primeru: <pre>Ompluscript.Model.define({\n  name: \"user\",\n  type: \"Model\",\n  attributes:\n  [\n    {\n      name: \"username\",\n      type: \"String\",\n      requred: true,\n      minimumLength: 8\n    },\n    {\n      name: \"email\",\n      type: \"String\",\n      requred: true,\n      pattern: /^\\S+@\\S+$/\n    },\n    {\n      name: \"birthday\",\n      type: \"Datetime\",\n      minimum: new Date().toISOString()\n    },\n    {\n      name: \"height\",\n      type: \"Number\",\n      minimum: 0,\n      maximum: 250\n    },\n    {\n      name: \"isAdmin\",\n      type: \"Boolean\",\n      requred: true\n    }\n  ]\n  proxies:\n  [\n    {\n      type: \"AjaxProxy\"\n    },\n    {\n      type: \"LocalStorageProxy\"\n    },\n    {\n      type: \"SessionStorageProxy\"\n    }\n  ]\n});</pre>",
  "text_model_explanation_message": "Primer iznad pokazuje kako treba da koristite okvir da definišite osnovni model, u ovom slučaju model koji bi se koristio za korisnika. On poseduje pet razlišitih atributa, za korisničko ime, elektronsku poštu, datum rođenja, visinu i opis koji oblašnjava da li je korisnik ujedno i administrator. Svi oni imaju svoj odgovarajuči tip, kao što su String (tekst), Number (broj), Datetime (datum) i Boolean (logička vrednost). Dodatno, tu su i definisani proxy-ji, koju možete koristiti za komunikaciju izmešu aplikacije i veb čitača/veb servera.",
  "text_view_title": "Pogled",
  "text_view_message": "Pogled, u okviru Ompluscript, reprezentuje komponentu koja je odgovorna za prezentaciju u veb čitaču. Ova komponenta ima pristup modelu i čeka na signal od njega, tako da može osveži podatke u prezentaciji. Pogled se sastoji od brojnih različitih prezentacionih elemenata, koji mogu biti kontenjeri za druge komponente, kao veb stranice, kao i neki elementi za direktnu komunikaciju sa korisnikom, kao input polja. Ispod možete naši primer za Pogled, korišćen za ovu veb stranicu: <pre>Ompluscript.View.define({\n  type: \"Page\",\n  name: \"/getting-started/view\",\n  layout:\n  {\n    type: \"LinearLayout\",\n    direction: \"vertical\"\n  },\n  children:\n  [\n    {\n      type: \"Header\",\n      name: \"view_title\",\n      text: \"text_view_title\"\n    },\n    {\n      type: \"Paragraph\",\n      name: \"view_message\",\n      text: \"text_view_message\"\n    },\n    {\n      type: \"Paragraph\",\n      name: \"view_explanation_message\",\n      text: \"text_view_explanation_message\"\n    }\n  ]\n});</pre>",
  "text_view_explanation_message": "Iznad možete videti osnovnu upotrebu komponente Pogleda. Komponenta veb stranice je kontenjer, čije ime takođe definiše i link ka željenoj veb stranici. Veb stranica takođe definiđe i raspored pogleda u njenom opsegu, koji će biti objašnjen u narednoj sekciji, i tri elementa kao deteta: jedan za naslova i dva za paragraf. Kao što se vidi, sva ova deva imaju posebne atribute nazvane \"text\n, koje reprezentuju ključeve za prevod.",
  "text_controller_title": "Kontroler",
  "text_controller_message": "Kontroler je treća komponenta u okviru Ompluscript. On poseduje kompletnu logiku aplikacije i takođe može komunicirati sa Modelom i pogledom. U okviru Ompluscript ima dva različita tipa Kontrolera: aplikacijski kontroler i kontroelr veb stranica. Aplikacijski kontroler se koristi da opiše  kompletne aplikacije i biće presentovan u narednoj sekciji. Kontroler veb stranice je potreban u slučajevima kada se traži neka određena logika za veb stranica, što treba biti implementirano preko akcijam kao što je opisano ispod:<pre>Ompluscript.Controller.define({\n  type: \"PageController\",\n  page:\n  {\n    type: \"Page\",\n    name: \"/search\",\n    ...\n  },\n  actions:\n  {\n    user: function(id) {,\n      ...\n    },\n    all: function() {\n      ...\n    }\n  }\n});</pre>",
  "text_controller_explanation_message": "U definiciji iznad, prezentovan je kontroler veb stranica. On sadrži definiciju za jednu stranicu i ona treba biti slična onoj kao u sekciji sa opisom Pogleda.Dodatno, može sadržati akcije, u ovom slučaju njih dve: \"users\" i \"all\". Obe akcije su reprezentovane adresom u address bar-u veb čitača (recimo \"/search/all\") i one su ustvari funkcije koje se pozivaju kada se unese link u address bar.",
  "text_application_title": "Aplikacija",
  "text_application_message": "A pliakciaj je reprezentovana kao jedan tip Kontrolera, ali u ovom slučaju kontroelr opisuje sve komponente (imena JavaScript datoteka) koje treba koristiti u procesu inicijalizacije apliakcije. Ova definicija treba biti postavljena u okviru glavne JavaScript datoteke, koja treba biti jedina pozvana iz glavne HTML datoteke. Ostale JavaScript datoteke su definisane u okviru kontrolera, kao što je prikazano ispod: <pre>Ompluscript.application({\n  components: [\"configuration\", \"homepage\", \"getting-started\", \"layouts\", \"form\", \"table\"],\n  events:\n  {\n    onComponentLoad: function (event) {\n      if (event.getComponent() === \"configuration\") {\n        Ompluscript.Model.Creator.getInstance().getTranslation().getProxy(\"AjaxProxy\").select();\n      }\n    }\n  }\n});</pre>",
  "text_application_explanation_message": "Kao što možete videti iznad, prikazan je primer kontrolera apliakcije, sličan ostalima. U ovom slučaju prikazana je lista komponenata, koja reprezentuje imena JavaScript datoteka, smeštenih unutar \n/app/\n direktorijuma (sa apsolutnom putanjom), a one se onda pozivaju u definisanom redosledu. Takođe, tu je i jedan definisani događaj - onaj koji sep oziva nakon što se izvrši svaka komponenta. U ovom slučaju, nakon pto se prva datoteka \"/app/configuration.js\" izvrši, definisan je zahtev za kontenjer sa prevodima da preuzme sve prevode sa servera, preko njegovog Ajax proxy-ja.",
  "text_layouts_title": "Rasporedi pogleda",
  "text_layouts_message": "Ova sekcija sadrži opis jezgra dizajna okvira Ompluscript - rasporede pogleda. Sa ovim rasporedima, možete napraviti različite dizajne veb stranica, upotrebom rasporeda koji najbolje odgovara svrsi veb stranice. U okviru Ompluscript, postoji (trenutno) 4 različita rasporeda pogleda:",
  "text_null_layout_title": "Prazan raspored",
  "text_null_layout_message": "Prazan raspored reprezentuje najjednostavniji raspred, na način da postavlja komponente jedne ispod drugih.",
  "text_null_layout_message_2": "Prazan raspored je standardni raspored za svaki pogled, pa zato nije potrebna specijalna konfiguracija za njega.",
  "text_relative_layout_title": "Relativni raspored",
  "text_relative_layout_message": "Iako Relativni raspored nije dobar izbor kada želite da koristite prilagodljivi veb dizajn, i dalje postoje određeni slučajevi kada želite da odredite striktnu poziciju za neku komponentu, kao u ovom slučaju: <pre>{\n  ...\n  styles:\n  {\n    top: \"50px\",\n    left: \"100px\",\n    width: \"200px\"\n  }\n}</pre>",
  "text_relative_layout_configuration": "Da bi postavili Relativni raspored, jednostavno postavite sledeću konfiguraciju u okviru jednog kontenjera pogleda:<pre>{\n  ...\n  layout:\n  {\n    type: \"RelativeLayout\",\n  }\n}</pre>",
  "text_linear_layout_title": "Linearni raspored",
  "text_linear_layout_message": "Linearni raspored definiše kontenjer gde se komponente mogu smestiti u različitim smerovima: odozgo na dole, odozdo na gore, s desna na levo, s leva na desno. U ovom slučaju, smer je s desna na levo, kao što se može videti u primeru levo:",
  "text_linear_layout_configuration": "<pre>{\n  ...\n  layout:\n  {\n    type: \"LinearLayout\",\n    reverse: true\n  }\n}</pre>",
  "text_linear_layout_message_2": "U ovom slučaju je moguže koristit vertikalni smer, kao što je definisano u sledećoj konfiguraciji:",
  "text_linear_layout_configuration_2": "<pre>{\n  ...\n  layout:\n  {\n    type: \"LinearLayout\",\n    \"direction\": \"vertical\",\n    \"align\": \"end\"\n  }\n}</pre>",
  "text_table_layout_title": "Tabelarni raspored",
  "text_table_layout_1_1_message": "Tabelarni respored representuje raspored u formi tabele, gde je moguće definisati broj redova i kolona.",
  "text_table_layout_configuration": "Za postavku Tabelarnog rasporeda, smestite sledeću konfiguraciju kao deo komponente koja poseduje druge komponente: <pre>{\n  ...\n  layout:\n  {\n    type: \"TableLayout\",\n    rows: 3,\n    cells: 2\n  }\n}</pre>",
  "text_table_layout_2_1_message": "U slučaju Tabelarnog rasporeda, broj komponenata-deca ne može biti veći od proizvoda broja redova i kolona.",
  "text_table_layout_2_2_message": "U pogledu komponeanta-deca, sve će biti postavljene u željenom redosledu definisanom u konfiguraciji: prva u prvu kolonu u prvom redu, druga u drugu kolonu u prvom redu itd.",
  "text_table_layout_3_1_message": "Svaka kolona dobija standardnu istu širinu, u zavisnosti od broja kolona po redu.",
  "text_table_layout_3_2_message": "Pazito dobro na sadržaj kolona, jer to može biti problem u implemetaciji prilagodljivog veb dizajna.",
  "text_advanced_technique_title": "Napredne tehnike",
  "text_navigation_title": "Navigacija",
  "text_navigation_message": "Navigacije je jedna od glavnih funkcionalnosti okvira Ompluscript. Kompletna logika se vodi od strane internog kontrolera, koji ne može da se konfiguriše, ali postoji poseban Pogled koji reprezentuje glavnu navigaciju. Ako nije konfigurisan, glavna navigacija se automatski kreira sa linkovima za sve stranice u okviru jedne linije. Ako je konfigurisana, ova konfiguracija će nadglasati standardnu, kao ova u sledećem primeru: <pre>Ompluscript.View.define({\n  type: \"Navigation\",\n  children:\n  [\n    {\n      type: \"PageLink\",\n      name: \"homepage\",\n      text: \"text_homepage_title,\n      page: \"/homepage\"\n    },\n    {\n      type: \"List\",\n      name: \"submenu\",\n      children:[\n        {\n          type: \"PageLink\",\n          name: \"terms\",\n          text: \"text_terms_title\",\n          page: \"/terms\"\n        },\n        {\n          type: \"PageLink\",\n          name: \"about\",\n          text: \"text_about_title\",\n          page: \"/about\"\n        }\n      ]\n    }\n  ]\n});</pre>",
  "text_navigation_explanation_message": "U primeru iznad, predstavljena je konfiguracija glavne navigacije. Kao što se primešuje, podržana je opcija prikaza linkova u jednoj liniji, kao i opcija podmenija. Za jednostavan link, u prvom nivou komponenata-dece, jednostavno koristite komponentu PageLink. Ali, u slučaju podmenija, komponenta List mora biti definisana - u tom slučaju, prva komponenta-dete će biti reprezentovana kao glavni element u prvoj liniji navigacije, a ostali kao elementi podmenija.",
  "text_translation_title": "Prevod",
  "text_translation_message": "Prevod je podržan od strane internog tipa modela, koji je uvek definisan od strane apliakcije, čak i kada nije definisan nekom konfiguracijom. Standardni kontenjer prevoda uvek ima jedan proxy - AjaxProxy, i striktno se preporučuje da ovakav proxy bude definisan u konfiguraciji, jer je to jedini način da se preuzme prevod sa servera. Ispod je jedan primer kontenjera prevoda: <pre>Ompluscript.Model.define({\n  type: \"Translation\",\n  proxies:\n  [\n    {\n      type: \"AjaxProxy\",\n      selectLink: \"/json/translation.json\"\n    }\n  ]\n});</pre>",
  "text_translation_explanation_message": "U primeru iznad je jednsotavan primer kontenjera za prevode. U ovom slučaju ima jedan proxy, AjaxProxy, koji definiše lokaciju sa preuzimanje prevoda sa servera. Ovo je reprezentovano sa atributom \"selectLink\".",
  "text_form_title": "Forme",
  "text_form_message": "Forma je jedna od glavnih komponenata u okviru Ompluscript. Ona treba da se koristi za bilo koji oblik komuniakcije sa veb serverom, kada korisnik treba da pošalje podatke ka veb serveru. Jednostavan primer formi je prikazan ispod, sa određenim pravilima validacije, definisanim modelom koji poseduje:",
  "text_form_configuration": "Primer iznad je reprezentovan sa konfiguracijom ispod. Forma treba da poseduje dva glavna dela: children i model. Model reprezentuje validaiciju u okviru atributa i AjaxProxy za komuniakciju sa serverom. Drugi deo, komponente-deca, reprezentuju input pilja koja su data korisniku da ih popuni za željenim podacima. Dodatno, tu su i dva glavna atributa konfiguracije: \"buttonAsset\" da definipe ključ za prevod dugmeta forme i \"proxy\" da reprezentuje tip akcije za AjaxProxy (moguće je koristiti save, update i delete akcije).<pre>Ompluscript.View.define({\n  type: \"Form\",\n  name: \"text_form_title\",\n  proxy: \"save\",\n  buttonAsset: \"text_register_title\",\n  styles:\n  {\n    \"max-width\": \"400px\"\n  },\n  model:\n  {\n    type: \"Model\",\n    name: \"model\",\n    attributes:\n    [\n      {\n        type: \"String\",\n        name: \"first_name\",\n        required: true\n      },\n      {\n        type: \"String\",\n        name: \"last_name\",\n        required: true\n      },\n      {\n        type: \"String\",\n        name: \"user_name\",\n        required: true,\n        minimumLength: 8\n      },\n      {\n        type: \"String\",\n        name: \"email\",\n        required: true,\n        pattern: /^(([^<>()\\[\\]\\\\.,;:\\s@\"]+(\\.[^<>()\\[\\]\\\\.,;:\\s@\"]+)*)|(\".+\"))@((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$/\n      },\n      {\n        type: \"String\",\n        name: \"password\",\n        required: true,\n        minimumLength: 8},\n      {\n        type: \"Datetime\",\n        name: \"birthday\",\n        required: true,\n        maximum: new Date().toISOString()\n      },\n      {\n        type: \"Number\",\n        name: \"height\",\n        minimum: 0,\n        maximum: 250\n      },\n      {\n        type: \"Number\",\n        name: \"weight\",\n        minimum: 0,\n        maximum: 250\n      }\n    ],\n    proxies:\n    [\n      {\n        type: \"AjaxProxy\",\n        saveLink: \"/json/success.json\"\n      }\n    ]\n  },\n  children:\n  [\n    {\n      type: \"TextInput\",\n      name: \"first_name\",\n      placeholder: \"text_first_name_title\"\n    },\n    {\n      type: \"TextInput\",\n      name: \"last_name\",\n      placeholder: \"text_last_name_title\"\n    },\n    {\n      type: \"TextInput\",\n      name: \"user_name\",\n      placeholder: \"text_user_name_title\"\n    },\n    {\n      type: \"EmailInput\",\n      name: \"email\",\n      placeholder: \"text_email_title\"\n    },\n    {\n      type: \"PasswordInput\",\n      name: \"password\",\n      placeholder: \"text_password_title\"\n    },\n    {\n      type: \"DateInput\",\n      name: \"birthday\",\n      placeholder: \"text_birthday_title\"\n    },\n    {\n      type: \"NumberInput\",\n      name: \"height\",\n      placeholder: \"text_height_title\"\n    },\n    {\n      type: \"NumberInput\",\n      name: \"weight\",\n      placeholder: \"text_weight_title\"\n    }\n  ]\n});</pre>",
  "text_form_title.failed": "Zahtev nije uspeo, pokušajte kasnije.",
  "text_first_name_title": "Ime",
  "first_name.102": "Ime mora biti upisano.",
  "text_last_name_title": "Prezime",
  "last_name.102": "Prezime mora biti upisano.",
  "text_user_name_title": "Korisničko ime",
  "user_name.102": "Korisniško ime mora biti upisano.",
  "user_name.211": "Korisničko ime mora imati najmanje 8 karaktera.",
  "text_email_title": "Elektronska pošta",
  "email.102": "Elektronska pošta mora biti upisana.",
  "email.221": "Mora biti u formatu elektornske pošte.",
  "text_password_title": "Šifra",
  "password.102": "Šifra  mora biti upisana.",
  "password.211": "Šifra mora imati najmanje 8 karaktera.",
  "text_birthday_title": "Datum rođenja",
  "birthday.102": "Datum rođenja mora biti upisan.",
  "birthday.202": "Datum rođenja ne može biti u budućnosti.",
  "text_height_title": "Visina",
  "height.201": "Visina ne može biti ispod 0.",
  "height.202": "Visina ne može biti preko 250.",
  "text_weight_title": "Težina",
  "weight.201": "Težina ne može biti ispod 0.",
  "weight.202": "Težina ne može biti iznad 250.",
  "text_register_title": "Registruj se",
  "text_404_error_title": "Stranica nije pronađena",
  "text_table_title": "Tabele i akcije",
  "text_table_message": "Ova skecija sadrži primere za tabele i akcije. Tabele su specijalne komponente Pogleda u okviru Ompluscript, sa kojima je moguće prikazati željene podatke uz pomoć specijalnog tipa modela - tabele. Akcije su već objašnjenje u sekciji vezanim za kontrolere veb stranica, a sipod možete naći linkove koje mapiraju ovu stranicu i dve dodatne akcije.",
  "text_table_configuration": "Primer iznad (tabela) reprezentuje konfiguraciju ispod. U ovoj konfiguraciji, možete videti tri glavna atributa: tabelu, koja reprezentuje kontenjer za atribute, kao i naslove as well as headers i ćelije kao decu. <pre>Ompluscript.Controller.define({\n  type: \"TableContainer\",\n  name: \"table\",\n  table:\n  {\n    type: \"Table\",\n    name: \"table\",\n    attributes:\n    [\n      {\n        type: \"String\",\n        name: \"user_name\"\n      },\n      {\n        type: \"String\",\n        name: \"first_name\"\n      },\n      {\n        type: \"String\",\n        name: \"last_name\"\n      },\n      {\n        type: \"String\",\n        name: \"birthday\"\n      }\n    ],\n    proxies:\n    [\n      {\n        type: \"AjaxProxy\",\n        selectLink: \"/json/users.json\"\n      }\n    ]\n  },\n  headers:\n  [\n    {\n      type: \"Label\",\n      name: \"user_name\",\n      text: \"text_user_name_title\"\n    },\n    {\n      type: \"Label\",\n      name: \"first_name\",\n      text: \"text_first_name_title\"\n    },\n    {\n      type: \"Label\",\n      name: \"last_name\",\n      text: \"text_last_name_title\"\n    },\n    {\n      type: \"Label\",\n      name: \"birthday\",\n      text: \"text_birthday_title\"\n    }\n  ],\n  cells:\n  [\n    {\n      type: \"LabelInput\",\n      name: \"user_name\"\n    },\n    {\n      type: \"LabelInput\",\n      name: \"first_name\"\n    },\n    {\n      type: \"LabelInput\",\n      name: \"last_name\"\n    },\n    {\n      type: \"LabelInput\",\n      name: \"birthday\"\n    }\n  ]\n});</pre>",
  "text_all_users_title": "Svi korisnici",
  "text_online_users_title": "Online korisnici",
  "text_offline_users_title": "Offline korisnici",
  "text_about_title": "O okviru",
  "text_about_message": "Okvir Ompluscrpt je kreran u svrhu diplomskog rada na Unveriztetu Metropolitan, Beograd, Srbija, od strane studenta Marko Milojević (broj indeksa 2604). Sve korišćeno u okviru ove prezentacije se koristi samo u akademske svrhe i za potrebe daljeg razvoja koda."
}